// **Задача**: Написать программу, которая из имеющегося массива строк формирует массив из строк, 
//длина которых меньше либо равна 3 символа.
// Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.
// При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массива


string [] array = new string [] {"459159", "qwerty", "45", "jjj", "---"};


//string str = "abcdefg";
//Console.WriteLine("1) The length of '{0}' is {1}", str, str.Length);
//Console.WriteLine("2) The length of '{0}' is {1}", "xyz", "xyz".Length);

//int length = str.Length;
//Console.WriteLine("3) The length of '{0}' is {1}", str, length);

// This example displays the following output:
//    1) The length of 'abcdefg' is 7
//    2) The length of 'xyz' is 3
//    3) The length of 'abcdefg' is 7


